{
  "heroImage": "/uploads/1771616982288-diugblv98v7.JPG",
  "updatedAt": "2026-02-20T20:24:34.693Z",
  "siteName": "Jamiul Azhar Jumma Masjidh",
  "footerTagline": "Serving the community with faith and compassion.",
  "welcomeSubtitle": "Welcome to",
  "heroTitleLine1": "Jamiul Azhar",
  "heroTitleLine2": "Jumma Masjidh",
  "heroTagline": "A house of worship and community at the heart of our neighbourhood.",
  "prayerTimesNote": "Prayer times will be displayed here. Contact the masjid for the current schedule.",
  "footerQuote": "May Allah accept our efforts and your support.",
  "aboutTitle": "About Us",
  "aboutSubtitle": "Our history and a message from the Imam.",
  "history": "Jamiul Azhar Jumma Masjidh was established to serve the local Muslim community. Over the years it has grown from a small prayer space into a full masjid with facilities for daily prayers, Jumu'ah, and community events.\n\nWe continue to expand our services and facilities with the support of our donors and volunteers. Our goal is to be a welcoming and inclusive place of worship and learning for all.",
  "imamMessage": "Assalamu Alaikum wa Rahmatullahi wa Barakatuhu.\n\nWelcome to Jamiul Azhar Jumma Masjidh. Our masjid has been a cornerstone of the community, providing a place for prayer, learning, and fellowship. We strive to serve with sincerity and to uphold the values of Islam in everything we do.\n\nI encourage you to visit, participate in our programs, and support our projects. May Allah guide us all and accept our efforts.\n\nJazakallah Khair.\n— Imam, Jamiul Azhar Jumma Masjidh",
  "contactTitle": "Contact",
  "contactSubtitle": "Get in touch with the masjid.",
  "contactVisitTitle": "Visit us",
  "contactDetailsTitle": "Contact details",
  "addressLine1": "Jamiul Azhar Jumma Masjidh",
  "addressLine2": "[Address to be updated]",
  "addressLine3": "Your City, State – PIN",
  "phone": "[Phone number to be updated]",
  "email": "contact@jajm.example.org",
  "contactFooterNote": "For donations, volunteer inquiries, or general questions, please visit the masjid office or use the contact details above. Admin login is available for authorised personnel only."
}